
String myHoliday(bool r) {
  if (MYHD) {
    uint8_t mm = TD.tm_mon + 1;
    uint8_t dd = TD.tm_mday;
    uint16_t yy = TD.tm_year + 1900;
    String holi_all = String(),
           holi_now = String(),
           holi_tomorrow = String();

    // Сегодня
    for (uint8_t i = 1; i <= HOLIDAY_COUNT; i++) {
      String hd_str(crm.var("HD" + String(i)));
      if (hd_str != "") {
        byte m = hd_str.substring(0, 2).toInt();
        byte d = hd_str.substring(2, 4).toInt();

        if (HDNF) {
          byte dd_new = 0, mm_new = 0;
          if (mm == 1 || mm == 3 || mm == 5 || mm == 7 || mm == 8 || mm == 10 || mm == 12) {
            if (dd + 1 < 32) {
              dd_new = dd + 1;
              mm_new = mm;
            } else {
              dd_new = 1;
              mm_new = (mm == 12 ? 1 : mm + 1);
            }
          } else {
            if (dd + 1 < (mm == 2 ? (yy % 4 == 0 ? 30 : 29) : 31)) {
              dd_new = dd + 1;
              mm_new = mm;
            } else {
              dd_new = 1;
              mm_new = mm + 1;
            }
          }
          if (m == mm_new && d == dd_new) {
            if (holi_tomorrow != "") holi_tomorrow += " ";
            holi_tomorrow += hd_str.substring(4);
            holi_tomorrow += ".";
          }
        }

        if (m == mm && d == dd) {
          if (holi_now != "") holi_now += " ";
          holi_now += hd_str.substring(4);
          holi_now += ".";
        }
      }
    }

    holi_all = holi_now;
    if (HDNF && holi_tomorrow != "") {
      if (holi_all != "") holi_all += F("   ");
      holi_all += "Завтра! >> ";
      holi_all += holi_tomorrow;
    }

    int indadr = holi_all.indexOf("%G");
    while (indadr > 2) {
      uint16_t Y = holi_all.substring(indadr + 2, indadr + 6).toInt();
      if (Y > 1000 && Y < 3000) {
        Y = abs(yy - Y);
        String Ystr(Y);
        uint8_t YY = Y % 10;
        if (Y != 11 && Y != 111 && YY == 1) Ystr += " год";
        else if (Y != 12 && Y != 13 && Y != 14 && (YY == 2 || YY == 3 || YY == 4)) Ystr += " года";
        else Ystr += " лет";
        holi_all.replace(holi_all.substring(indadr, indadr + 6), Ystr);
        indadr = holi_all.indexOf("%G");
      } else break;
    }

    if (r && holi_all != "") holi_all = "  ***  " + holi_all;
    return holi_all;
  }
  return String();
}


String holiday(byte region, int gg, uint8_t mm, uint8_t dd, uint8_t dn, bool razd) {
  String b("");

  //Россия
  if (region == 1) {
    switch (mm) {
      case 1: {
          switch (dd) {
            case 1: {
                b = F("C НОВЫМ ");
                b += gg;
                b += F(" ГОДОМ.");
              } break;
            case 2: case 3: case 4: case 5: case 8: b = F("Новогодние праздники."); break;
            case 6: b = F("Новогодние праздники."); break;
            case 7: b = F("Новогодние праздники. Рождество Христово."); break;
            case 12: b = F("День работника прокуратуры РФ."); break;
            case 13: b = F("День российской печати."); break;
            case 14: b = F("День трубопроводных войск."); break;
						case 19: b = F("Крещение Господне."); break;
            case 21: b = F("День инженерных войск."); break;
            case 25: b = F("Татьянин день (День российского студенчества)."); break;
            case 27: b = F("День снятия блокады г. Ленинграда."); break;
            default: break;
          }
        } break;


      case 2:
        switch (dd) {
          case 2: b = F("День разгрома советскими войсками немецко-фашистских войск в Сталинградской битве в 1943 г."); break;
          case 8: b = F("День российской науки. Международный день стоматолога."); break;
          case 9: b = F("День работника гражданской авиации."); break;
          case 10: b = F("День дипломатического работника."); break;
          case 14: b = F("День всех влюбленных!"); break;
          case 15: b = F("День памяти воинов-интернационалистов."); break;
          case 17: b = F("День российских студенческих отрядов."); break;
          case 23: b = F("День защитника Отечества."); break;
          case 27: b = F("День Сил специальных операций."); break;
          default: break;
        } break;


      case 3: {
          switch (dd) {
            case 1: b = F("День эксперта-криминалиста. Всемирный день Гражданской обороны."); break;
            case 8: b = F("Международный женский день."); break;
            case 11: b = F("День работника органов наркоконтроля."); break;
            case 12: b = F("День работников уголовно-исполнительной системы Минюста."); break;
            case 19: b = F("День моряка-подводника."); break;
            case 23: b = F("День работников гидрометеорологической службы России."); break;
            case 25: b = F("День работника культуры России."); break;
            case 27: b = F("День войск национальной гвардии РФ."); break;
            case 29: b = F("День специалиста юридической службы."); break;
            default:  break;
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День работников геодезии и картографии.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День работников торговли, бытового обслуживания населения и ЖКХ.");
          }
        } break;


      case 4: {
          switch (dd) {
            case 1: b = F("День смеха."); break;
            case 2: b = F("День единения народов."); break;
            case 4: b = F("День Интернета."); break;
            case 8: b = F("День сотрудников военных коммиссариатов. День российской анимации."); break;
            case 12: b = F("День космонавтики."); break;
            case 15: b = F("День специалиста по радиоэлектронной борьбе."); break;
            case 18: b = F("День победы русских воинов князя Александра Невского над немецкими рыцарями на Чудском озере (Ледовое побоище, 1242 год)."); break;
            case 19: b = F("День российской полиграфии. День принятия Крыма, Тамани и Кубани в состав Российской империи."); break;
            case 21: b = F("День местного самоуправления."); break;
            case 26: b = F("День памяти погибших в радиационных авариях и катастрофах. День нотариуса."); break;
            case 27: b = F("День российского парламентаризма."); break;
            case 28: b = F("День работника скорой медицинской помощи. Международный день охраны труда."); break;
            case 30: b = F("День пожарной охраны."); break;
            default:  break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День геолога.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День войск противовоздушной обороны России.");
          }
        } break;


      case 5: {
          switch (dd) {
            case 1: b = F("Праздник Весны и Труда."); break;
            case 7: b = F("День радио, праздник работников всех отраслей связи. День Президентского полка."); break;
            case 9: {
                b = F("ДЕНЬ ПОБЕДЫ! Окончание Великой Отечественной войны, ");
                byte Y = gg - 1945;
                b += Y;
                uint8_t YY = Y % 10;
                if (Y != 11 && Y != 111 && YY == 1) b += F(" год.");
                else if (Y != 12 && Y != 13 && Y != 14 && (YY == 2 || YY == 3 || YY == 4)) b += F(" года.");
                else b += F(" лет.");
                break;
              }
            case 20: b = F("Всемирный день метрологии. Всемирный день врача-травматолога."); break;
            case 21: b = F("День полярника."); break;
            case 24: b = F("День славянской письменности и культуры. День кадрового работника."); break;
            case 25: b = F("День филолога."); break;
            case 26: b = F("День российского предпринимательства."); break;
            case 27: b = F("Общероссийский день библиотек."); break;
            case 28: b = F("День пограничника."); break;
            case 29: b = F("День военного автомобилиста."); break;
            case 31: b = F("День российской адвокатуры."); break;
            default:  break;
          }
          if (dn == 7 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("День химика.");
          }
        } break;


      case 6: {
          switch (dd) {
            case 1: b = F("Международный день защиты детей."); break;
            case 2: b = F("День спутникового мониторинга и навигации."); break;
            case 5: b = F("День эколога."); break;
            case 6: b = F("Пушкинский день России. День русского языка."); break;
            case 8: b = F("День социального работника."); break;
            case 9: b = F("День группы советских войск в Германии."); break;
            case 12: b = F("День России."); break;
            case 14: b = F("День работников миграционной службы."); break;
            case 18: b = F("День службы военных сообщений."); break;
            case 22: b = F("День начала Великой Отечественной войны (4:00, 1941 г.)."); break;
            case 25: b = F("День работника статистики."); break;
            case 27: b = F("День молодежи."); break;
            case 29: b = F("День партизан и подпольщиков. День кораблестроителя."); break;
            case 30: b = F("День экономиста."); break;
            default:  break;
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День работников текстильной и легкой промышленности.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День медицинского работника.");
          }
          if (dn == 7 && dd > 16 && dd < 24) {
            if (b != "") b += F(" ");
            b += F("День народных художественных промыслов.");
          }
          if (dn == 6 && dd > 23) {
            if (b != "") b += F(" ");
            b += F("День изобретателя и рационализатора.");
          }
        } break;


      case 7: {
          switch (dd) {
            case 3: b = F("День ГАИ (ГИБДД МВД РФ)."); break;
            case 7: b = F("День победы русского флота над турецким флотом в Чесменском сражении."); break;
            case 8: b = F("День семьи, любви и верности."); break;
            case 10: b = F("День победы русской армии под командованием Петра Первого над шведами (Полтавское сражение 1709 г.)."); break;
            case 12: b = F("День Святых Первоверховных апостолов Петра и Павла. День Святых апостолов Петра и Павла."); break;
            case 17: b = F("День этнографа."); break;
            case 25: b = F("День сотрудника органов следствия РФ."); break;
            case 28: b = F("День крещения Руси (988 г.)."); break;
            default:  break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День работников морского и речного флота.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День рыбака. День российской почты.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День металлурга.");
          }
          if (dn == 6 && dd > 20 && dd < 29) {
            if (b != "") b += F(" ");
            b += F("День работника торговли.");
          }
          if (dn == 5 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("День системного администратора.");
          }
          if (dn == 7 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("День Военно-Морского Флота.");
          }
        } break;


      case 8: {
          switch (dd) {
            case 1: b = F("День Тыла ВС РФ. День памяти российских воинов, погибших в Первой мировой войне 1914-1918гг. День памяти пожарных, погибших при исполнении служебного долга."); break;
            case 2: b = F("День ВДВ."); break;
            case 6: b = F("День железнодорожных войск."); break;
            case 9: b = F("День первой морской победы русского флота под командованием Петра Первого над шведами у мыса Гангут в 1714 г."); break;
            case 12: b = F("День ВВС РФ."); break;
            case 15: b = F("День археолога."); break;
            case 18: b = F("День географа."); break;
            case 22: b = F("День Государственного флага РФ."); break;
            case 23: b = F("День разгрома советскими войсками немецко-фашистских войск в Курской битве в 1943 г."); break;
            case 27: b = F("День кино."); break;
            case 31: b = F("День ветеринарного работника."); break;
            default:  break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День железнодорожника.");
          }
          if (dn == 5 && dd > 6 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День физкультурника.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День строителя.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День Воздушного Флота России.");
          }
          if (dn == 7 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("День шахтера.");
          }
        } break;


      case 9: {
          switch (dd) {
            case 1: b = F("День знаний. Начало Второй мировой войны (1939 г.)."); break;
            case 2: b = F("День российской гвардии."); break;
            case 3: b = F("День окончания Второй мировой войны (1945 г.). День солидарности в борьбе с терроризмом."); break;
            case 4: b = F("День специалиста по ядерному обеспечению."); break;
            case 8: b = F("День финансиста. День Бородинского сражения русской армии под командованием М. И. Кутузова с французской армией в 1812 г."); break;
            case 9: b = F("День тестировщика."); break;
            case 11: b = F("День победы русской эскадры под командованием Ф.Ф. Ушакова над турецкой эскадрой у мыса Тендра в 1790 г."); break;
            case 12: if (gg % 4 == 0) b = F("День программиста."); break;
            case 13: if (gg % 4 != 0) b = F("День программиста."); break;
            case 19: b = F("День оружейника."); break;
            case 21: b = F("День победы русских полков во главе с великим князем Дмитрием Донским над монголо-татарскими войсками в Куликовской битве, в 1380 г. День зарождения российской государственности в 862 г."); break;
            case 24: b = F("День системного аналитика."); break;
            case 27: b = F("Всемирный день туризма. День воспитателя и всех дошкольных работников."); break;
            case 28: b = F("День работника атомной промышленности."); break;
            case 30: b = F("День переводчика."); break;
            default:  break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День работников нефтяной и газовой промышленности.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День танкиста.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День работников леса и лесоперерабатывающей промышленности.");
          }
          if (dn == 7 && dd > 23) {
            if (b != "") b += F(" ");
            b += F("День машиностроителя.");
          }
        } break;


      case 10: {
          switch (dd) {
            case 1: b = F("День пожилых людей. День Сухопутных войск."); break;
            case 4: b = F("День космических войск. День войск гражданской обороны РФ."); break;
            case 5: b = F("День учителя."); break;
            case 6: b = F("День российского страховщика."); break;
            case 9: b = F("День разгрома советскими войсками немецко-фашистских войск в битве за Кавказ в 1943 г."); break;
            case 14: b = F("Покров Пресвятой Богородицы."); break;
            case 19: b = F("Всероссийский день лицеиста."); break;
            case 20: b = F("День военного связиста."); break;
            case 22: b = F("День финансово-экономической службы."); break;
            case 23: b = F("День работников рекламы."); break;
            case 24: b = F("День подразделений специального назначения."); break;
            case 25: b = F("День таможенника РФ."); break;
            case 29: b = F("День вневедомственной охраны."); break;
            case 30: b = F("День инженера-механика. День памяти жертв политических репрессий."); break;
            case 31: b = F("День работников СИЗО и тюрем."); break;
            default:  break;
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День работника сельского хозяйства и перерабатывающей промышленности.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День ОТЦА! День работников дорожного хозяйства.");
          }
          if (dn == 7 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("День автомобилиста.");
          }
        } break;


      case 11: {
          switch (dd) {
            case 1: b = F("День менеджера. День судебного пристава РФ."); break;
            case 4: b = F("День народного единства. День воинской славы России."); break;
            case 5: b = F("День военного разведчика."); break;
            case 7: b = F("День согласия и примирения. Годовщина Великой Октябрьской социалистической революции в 1917 г."); break;
            case 9: b = F("День специального отряда быстрого реагирования."); break;
            case 10: b = F("День сотрудника ОВД РФ."); break;
            case 11: b = F("День экономиста."); break;
            case 13: b = F("День войск радиационной, химической и биологической защиты."); break;
            case 14: b = F("День социолога."); break;
            case 16: b = F("День самбо."); break;
            case 19: b = F("Международный мужской день. День ракетных войск и артиллерии."); break;
            case 20: b = F("День работника транспорта."); break;
            case 21: b = F("День бухгалтера. День работника налоговых органов."); break;
            case 22: b = F("День психолога."); break;
            case 27: b = F("День оценщика. День морской пехоты."); break;
            case 30: b = F("Международный день защиты информации."); break;
            default:  break;
          }
          if (dn == 7 && dd > 23) {
            if (b != "") b += F(" ");
            b += F("День МАТЕРИ!");
          }

        } break;


      case 12: {
          switch (dd) {
            case 1: b = F("День победы русской эскадры под командованием П.С. Нахимова над турецкой эскадрой у мыса Синоп в 1853 г."); break;
            case 3: b = F("День Неизвестного солдата. День юриста."); break;
            case 5: b = F("День Добровольца. День начала контрнаступления советских войск против немецко-фашистских войск в битве под Москвой в 1941 г."); break;
            case 9: b = F("День Героев Отечества."); break;
            case 12: b = F("День Конституции РФ."); break;
            case 17: b = F("День Ракетных войск стратегического назначения."); break;
            case 18: b = F("День работника органов ЗАГС."); break;
            case 19: b = F("День работника военной контрразведки РФ."); break;
            case 20: b = F("День работника органов безопасности РФ."); break;
            case 22: b = F("День энергетика."); break;
            case 24: b = F("День взятия турецкой крепости Измаил русскими войсками под командованием А.В. Суворова в 1790 г."); break;
            case 27: b = F("День спасателя РФ."); break;
            case 31: {
                b = F("Последний день уходящего года. С НАСТУПАЮЩИМ ");
                b += gg + 1;
                b += F(" годом !!!");
                break;
              }
            default: break;
          }
        } break;
    }

    //Украина
  } else if (region == 2) {
    switch (mm) {
      case 1:
        switch (dd) {
          case 1: return F("Новий рiк!"); break;
          case 2: return F("Новорiчнi свята."); break;
          case 6: return F("Святий вечiр."); break;
          case 7: return F("Рiздво Христове."); break;
          case 13: return F("Щедрий вечiр."); break;
          case 14: return F("Старий Новий рік."); break;
          case 19: return F("Хрещення Господнє (Богоявління). "); break;
          case 20: return F("День Автономної Республіки Крим. "); break;
          case 21: return F("Мiжнародний день обiймiв."); break;
          case 22: return F("День Соборностi України."); break;
          case 24: return F("День зовнiшньої розвiдки України."); break;
          case 25: return F("День студентiв (Тетянин день); Китайський Новий рiк."); break;
          case 26: return F("Мiжнародний день митника. День працiвникiв контрольно-ревiзiйної служби України."); break;
          case 27: return F("Міжнародний день пам'яті жертв Голокосту."); break;
          case 29: return F("День пам'ятi героiв Крут. День працівника пожежної охорони. День мобiлiзацiї зусиль проти загрози ядерної вiйни."); break;
          case 31: return F("Межнародний день ювеліра."); break;
          default: break;
        }
        break;


      case 2:
        switch (dd) {
          case 2: return F("День бабака. День водно-болотних угiдь."); break;
          case 4: return F("Всесвітній день боротьби проти раку. День безпечного Інтернету."); break;
          case 6: return F("Міжнародний день бармена."); break;
          case 9: return F("Міжнародний день стоматолога."); break;
          case 11: return F("Всесвітній день хворого."); break;
          case 14: return F("День святого Валентина, День закоханих."); break;
          case 15: return F("Стрiтення Господнє. День вшановування учасників бойових дій на території інших держав."); break;
          case 17: return F("День кота в Європi; День спонтанного прояву доброти."); break;
          case 19: return F("Мiжнародний день захисту морських ссавцiв."); break;
          case 20: return F("Всесвітній день соціальної справедливості."); break;
          case 21: return F("Мiжнародний день рiдної мови."); break;
          case 22: return F("Міжнародний день підтримки жертв злочинів."); break;
          case 28: return F("День працівників патрульно-постової служби України. День штурманської служби авіації збройних сил України."); break;
          default: break;
        }
        break;


      case 3: {

          switch (dd) {
            case 1: b = F("Початок весни. Всесвітній день цивільної оборони."); break;
            case 3: b = F("Всесвітній день письменника."); break;
            case 8: b = F("Мiжнародний жiночий день."); break;
            case 9: b = F("Міжнародний день ді-джея (World DJ Day)."); break;
            case 13: b = F("Мiжнародний день сну."); break;
            case 14: b = F("День українського добровольця."); break;
            case 15: b = F("Всесвiтнiй день захисту прав споживачiв."); break;
            case 18: b = F("День працiвника податкової та митної справи України."); break;
            case 20: b = F("День весняного рiвнодення; Мiжнародний день щастя."); break;
            case 21: b = F("Міжнародний день лялькаря. Всесвітній день поезії."); break;
            case 22: b = F("День таксиста."); break;
            case 23: b = F("Всеукраїнський день працiвникiв культури та аматорiв народного мистецтва."); break;
            case 24: b = F("Всесвітній день боротьби пpоти туберкульозу."); break;
            case 25: b = F("День Служби безпеки України. Міжнародний день пам'ятi жертв рабства тa трансатлантичної работоргівлі."); break;
            case 26: b = F("День Внутрішніх військ МВС. День Нацiональної гвардiї України."); break;
            case 27: b = F("Міжнародний день театру."); break;
            case 28: b = F("Година Землi."); break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("Всесвітній день дитячого телебачення і радіомовлення.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День землевпорядника.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День працiвника житлово-комунального господарства i побутового обслуговування населення.");
          }

        }
        break;


      case 4: {

          switch (dd) {
            case 1: b = F("День Смiху!"); break;
            case 4: b = F("Міжнародний день Інтернету. День веб-майстра; Мiжнародний День бродячих тварин."); break;
            case 7: b = F("Благовiщення. Всесвітній день здоров'я"); break;
            case 12: b = F("Всесвiтнiй день авiацii та космонавтики. День працiвникiв ракетно-космiчноi галузi України."); break;
            case 15: b = F("День співробітників кримінального розшуку України."); break;
            case 17: b = F("День пожежної охорони."); break;
            case 18: b = F("День пам'яток iсторiї та культури."); break;
            case 22: b = F("Міжнародний день секретаря."); break;
            case 23: b = F("Всеукраїнський день психолога. Міжнародний день астрономії."); break;
            case 26: b = F("Мiжнародний день пам'ятi жертв радiацiйних аварiй i катастроф."); break;
            case 28: b = F("Всесвiтнiй день охорони працi."); break;
            case 29: b = F("Міжнародний день танцю."); break;
            case 30: b = F("День прикордонника."); break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День геолога.");
          }


        }
        break;


      case 5: {

          switch (dd) {
            case 1: b = F("Свято Весни i Працi та Мiжнародний день солiдарностi трудящих."); break;
            case 3: b = F("День кондитерів. Всесвітній день свободи друку"); break;
            case 5: b = F("Міжнародний день акушерки"); break;
            case 6: b = F("День пiхоти"); break;
            case 7: b = F("День Радiо."); break;
            case 8: b = F("День пам'ятi та примирення в Українi. Міжнародний день Червоного Хреста."); break;
            case 9: b = F("День Перемоги! День Європи міжнародний)."); break;
            case 10: b = F("День матерi в Українi."); break;
            case 12: b = F("Всесвітній день медсестер."); break;
            case 15: b = F("Всеукраїнський день працівників культури. Міжнародний день сім'ї."); break;
            case 16: b = F("День Європи (український). День науки."); break;
            case 17: b = F("Всесвітній день електрозв'язку тa інформаційного суспільства. День молодіжних тa дитячих громадських організацій. День пам'ятi жертв політичних репресій."); break;
            case 18: b = F("День боротьби за права кримськотатарського народу. День резервiста України."); break;
            case 20: b = F("День банкiвських працiвникiв."); break;
            case 21: b = F("День вишиванки."); break;
            case 24: b = F("День слов'янської писемностi i культури."); break;
            case 25: b = F("День філолога."); break;
            case 29: b = F("Мiжнародний день миротворцiв ООН."); break;
            case 31: b = F("Всесвiтнiй день блондинок."); break;
          }
          if (dn == 7 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("Де́нь хiмiка.");
          }

        }
        break;


      case 6: {
          switch (dd) {
            case 1: b = F("Всесвiтнiй день батькiв; День захисту дiтей; Початок лiта."); break;
            case 5: b = F("Всесвітній день довкілля."); break;
            case 6: b = F("День журналiста."); break;
            case 7: b = F("День працівників водного господарства. День працівників місцевої промисловості."); break;
            case 8: b = F("Мiжнародний день домогосподарки i домохазяїна."); break;
            case 12: b = F("День працiвника фондового ринку."); break;
            case 14: b = F("Всесвітній день донора."); break;
            case 20: b = F("День лiтнього сонцестояння."); break;
            case 21: b = F("Мiжнародний день скейтбордингу"); break;
            case 22: b = F("День скорботи i вшанування пам'ятi жертв вiйни в Українi."); break;
            case 23: b = F("День державної служби ООН."); break;
            case 25: b = F("Міжнародний день моряка."); break;
            case 27: b = F("Випускний."); break;
            case 28: b = F("День Конституцiї України."); break;
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День працiвникiв легкої промисловостi.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День батька (День тата). День медичного працiвника.");
          }
          if (dn == 6 && dd > 23) {
            if (b != "") b += F(" ");
            b += F("День молодi.");
          }

        }
        break;


      case 7: {

          switch (dd) {
            case 1: b = F("День архiтектури України. День слідчого"); break;
            case 4: b = F("День судового експерта."); break;
            case 6: b = F("Всесвiтнiй день поцiлунку. День військ ППО Збpойних Сил України."); break;
            case 7: b = F("Свято Івана Купала. День працiвника природно-заповiдноi справи"); break;
            case 8: b = F("День родини."); break;
            case 12: b = F("День фотографа. День рибалки."); break;
            case 15: b = F("День українських миротворців."); break;
            case 16: b = F("День бухгалтера."); break;
            case 20: b = F("Мiжнародний день шахiв."); break;
            case 28: b = F("День хрещення Киiвськоi Русi - України."); break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День Вiйськово-Морських Сил Збройних Сил України. День працiвникiв морського та рiчкового флоту.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День рибалки.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День працiвникiв металургiйної та гiрничодобувної промисловостi.");
          }
          if (dn == 6 && dd > 20 && dd < 29) {
            if (b != "") b += F(" ");
            b += F("День працiвникiв торгiвлi.");
          }

        }
        break;


      case 8: {

          switch (dd) {
            case 1: b = F("День інкасатора."); break;
            case 4: b = F("День Нацiональної полiцiї України."); break;
            case 8: b = F("Всесвiтнiй день кiшок; День фiзкультурника; День вiйськ зв'язку."); break;
            case 12: b = F("Міжнародний день молоді."); break;
            case 13: b = F("Всесвiтнiй день шульги."); break;
            case 14: b = F("Маковiя."); break;
            case 15: b = F("День археолога."); break;
            case 19: b = F("День пасiчника України; Преображення Господнє."); break;
            case 23: b = F("День Державного Прапора України."); break;
            case 24: b = F("День Незалежностi України."); break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День Повiтряних Сил Збройних Сил України.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День будiвельника. День працiвникiв ветеринарної медицини.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День авiацiї.");
          }
          if (dn == 7 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("День шахтаря.");
          }

        }
        break;


      case 9: {

          switch (dd) {
            case 1: b = F("День знань."); break;
            case 2: b = F("День нотарiату."); break;
            case 12: {
                b = F("День українського кiно; День фiзичної культури i спорту України.");
                if (gg % 4 == 0) b = F("День комп'ютерника i програмiста.");
                break;
              }
            case 13: if (gg % 4 != 0) b = F("День комп'ютерника i програмiста."); break;
            case 17: b = F("День рятiвника."); break;
            case 19: b = F("Чудо; День народження смайла."); break;
            case 20: b = F("Всенародний День Батька."); break;
            case 21: b = F("День миру."); break;
            case 22: b = F("День без автомобiлiв; День осiннього рiвнодення."); break;
            case 27: b = F("День туризму. Всеукраїнський день дошкiлля."); break;
            case 30: b = F("Всеукраїнський день бiблiотек."); break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День пiдприємця.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День танкiстiв.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День працiвника лiсу.");
          }
          if (dn == 7 && dd > 23) {
            if (b != "") b += F(" ");
            b += F("День машинобудiвника.");
          }

        }
        break;


      case 10: {

          switch (dd) {
            case 2: b = F("Всесвiтнiй день усмiшки."); break;
            case 4: b = F("Український День вчителя (День працiвникiв освiти чи День освiтянина)."); break;
            case 8: b = F("День юриста."); break;
            case 9: b = F("Всесвітній день пошти. Всесвiтнiй день яйця."); break;
            case 10: b = F("День працiвникiв стандартизацiї та метрологiї."); break;
            case 14: b = F("День Українського козацтва; День захисника України (День захисникiв Батьківщини)."); break;
            case 28: b = F("День визволення України вiд фашистських загарбникiв."); break;
            case 31: b = F("Міжнародний день Чорного моря."); break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День працiвникiв освiти.");
          }
          if (dn == 7 && dd > 7 && dd < 15) {
            if (b != "") b += F(" ");
            b += F("День художника. День працiвникiв державної санiтарно-епiдемiологiчної служби.");
          }
          if (dn == 7 && dd > 14 && dd < 22) {
            if (b != "") b += F(" ");
            b += F("День працiвникiв харчової промисловостi.");
          }
          if (dn == 7 && dd > 24) {
            if (b != "") b += F(" ");
            b += F("День автомобiлiста i дорожника.");
          }

        }
        break;


      case 11: {

          switch (dd) {
            case 2: b = F("День iнженерних вiйськ. День ракетних вiйськ i артилерiї."); break;
            case 4: b = F("День залiзничника."); break;
            case 8: b = F("Мiжнародний день КВК."); break;
            case 9: b = F("День українськоi писемностi та мови."); break;
            case 16: b = F("День працiвникiв радiо, телебачення та зв'язку. День морськоi пiхоти."); break;
            case 17: b = F("День студента."); break;
            case 18: b = F("День сержанта Збройних Сил України."); break;
            case 19: b = F("День працiвникiв гiдрометеорологiчної служби."); break;
            case 21: b = F("Всесвiтнiй день вiтань. День Гiдностi та Свободи."); break;
            case 26: b = F("День подяки."); break;
            case 30: b = F("День домашнiх тварин."); break;
          }
          if (dn == 7 && dd < 8) {
            if (b != "") b += F(" ");
            b += F("День працiвника соцiальноi сфери.");
          }
          if (dn == 7 && dd > 23) {
            if (b != "") b += F(" ");
            b += F("День працiвникiв сiльського господарства.");
          }

        }
        break;


      case 12:
        switch (dd) {
          case 1: b = F("День працiвникiв прокуратури."); break;
          case 5: b = F("День працiвникiв статистики."); break;
          case 6: b = F("День Збройних Сил України."); break;
          case 7: b = F("День мiсцевого самоврядування."); break;
          case 10: b = F("Всесвiтнiй день футболу."); break;
          case 12: b = F("День Сухопутних вiйськ Украiни."); break;
          case 14: b = F("День вшанування учасникiв лiквiдацiї наслiдкiв аварiї на Чорнобильськiй АЕС."); break;
          case 15: b = F("Мiжнародний день чаю. День працiвникiв суду."); break;
          case 17: b = F("День працiвника державної виконавчої служби."); break;
          case 19: b = F("День святого Миколая. День адвокатури."); break;
          case 22: b = F("День енергетика. День дипломатичної служби України."); break;
          case 24: b = F("День працiвникiв архiвних установ."); break;
          case 25: b = F("Католицьке Рiздво; Лютеранське Рiздво."); break;
          case 26: b = F("День подарункiв."); break;
          case 31: b = F("Останнiй день року, ВЕСЕЛИХ НОВОРІЧНИХ СВЯТ!!!"); break;
          default: break;
        }
        break;
    }

    //Беларусь
  } else if (region == 3) {
    switch (mm) {
      case 1:
        switch (dd) {
          case 1: b = F("НОВЫЙ ГОД."); break;
          case 2: case 3: b = F("Новогодние праздники."); break;
          case 4: b = F("День Ньютона. Настасьин день."); break;
          case 5: b = F("День работников социальной защиты."); break;
          case 6: b = F("Рождественский сочельник. Святки 1-й день. День банковских и финансовых работников."); break;
          case 7: b = F("Рождество Христово."); break;
          case 8: b = F("День работника прокуратуры РФ."); break;
          case 9: b = F("День российской печати."); break;
          case 10: b = F("День инженерных войск."); break;
          case 11: b = F("Татьянин день. День российского студенчества."); break;
          case 12: b = F("День снятия блокады города Ленинград."); break;
          case 13: b = F("Святки 8 день."); break;
          case 14: b = F("Святки 9 день. Старый Новый год."); break;
          case 15: b = F("Святки 10 день. День рождения Википедии."); break;
          case 16: b = F("Святки 11 день. Всемирный день «The Beatles»."); break;
          case 17: b = F("Святки 12 день. День творчества и вдохновения."); break;
          case 18: b = F("Святки 13 день. Крещенский сочельник."); break;
          case 19: b = F("Крещение Господне. День работника службы спасения."); break;
          case 21: b = F("День инженерных войск. Международный день объятий."); break;
          case 25: b = F("Татьянин день (День студента)."); break;
          case 26: b = F("Международный день таможенника."); break;
          case 27: b = F("Международный день памяти жертв Холокоста."); break;
          case 28: b = F("Международный день защиты персональных данных."); break;
          case 30: b = F("День Деда Мороза и Снегурки."); break;
          case 31: b = F("Международный день БЕЗ интернета. Международный день ювелира."); break;
          default: break;
        } break;


      case 2:
        switch (dd) {
          case 4: b = F("Всемирный день борьбы против рака."); break;
          case 6: b = F("Международный день бармена."); break;
          case 9: b = F("Всемирный день безопасного Интернета. Международный день стоматолога."); break;
          case 13: b = F("Всемирный день радио."); break;
          case 14: b = F("День Святого Валентина (День всех влюбленных). День компьютерщика."); break;
          case 15: b = F("День памяти воинов-интернационалистов. Сретение Господне."); break;
          case 16: b = F("Починки."); break;
          case 19: b = F("Всемирный день защиты морских млекопитающих."); break;
          case 21: b = F("Всемирный день экскурсовода."); break;
          case 22: b = F("Международный день поддержки жертв преступлений."); break;
          case 23: b = F("День защитника Отечества."); break;
          case 25: b = F("День рождения револьвера."); break;
          case 27: b = F("День Сил специальных операций."); break;
          default: break;
        } break;


      case 3:
        switch (dd) {
          case 1: b = F("Всемирный день гражданской обороны. Всемирный день иммунитета. День хостинг-провайдера."); break;
          case 2: b = F("Международный день спички."); break;
          case 3: b = F("Всемирный день дикой природы. Всемирный день писателя."); break;
          case 4: b = F("Международный день детского телевидения и радиовещания."); break;
          case 5: b = F("День выключенных гаджетов."); break;
          case 6: b = F("Международный день зубного врача."); break;
          case 7: b = F("День рождения телефонного аппарата."); break;
          case 8: b = F("Международный женский день. Масленица 1 день."); break;
          case 9: b = F("Масленица 2 день. Всемирный день диджея."); break;
          case 10: b = F("Масленица 3 день."); break;
          case 11: b = F("Масленица 4 день."); break;
          case 12: b = F("Масленица 5 день. Всемирный день ананаса."); break;
          case 13: b = F("Масленица 6 день."); break;
          case 14: b = F("Масленица 7 день. Международный день рек. Прощеное воскресенье."); break;
          case 15: b = F("Всемирный день защиты прав потребителей. День добрых дел. Чистый понедельник."); break;
          case 19: b = F("Международный день клиента. Первый день без шапки. Час Земли."); break;
          case 20: b = F("День весеннего равноденствия. Международный день без мяса. Международный день счастья."); break;
          case 21: b = F("Всемирный день поэзии. Международный день кукольника. Международный день лесов."); break;
          case 22: b = F("Всемирный день водных ресурсов. Международный день таксиста."); break;
          case 24: b = F("Всемирный день борьбы против туберкулеза. День работников бытового обслуживания населения и ЖКХ. День памяти самых близких."); break;
          case 27: b = F("Всемирный день театра. День нефролога."); break;
          case 28: b = F("День больших перемен."); break;
          case 29: b = F("День специалиста юридической службы."); break;
          case 30: b = F("День защиты Земли."); break;
          case 31: b = F("Международный день резервного копирования."); break;
          default: break;
        } break;


      case 4:
        switch (dd) {
          case 1: b = F("День смеха. День математика. Международный день птиц."); break;
          case 2: b = F("Международный день детской книги."); break;
          case 3: b = F("День рождения мобильного телефона."); break;
          case 4: b = F("День веб-мастера. День геолога."); break;
          case 7: b = F("Благовещенье. Всемирный день здоровья. День косметолога. День памяти погибших подводников."); break;
          case 10: b = F("День брата и сестры."); break;
          case 11: b = F("День войск противовоздушной обороны."); break;
          case 12: b = F("День космонавтики."); break;
          case 13: b = F("Всемирный день рок-н-ролла."); break;
          case 15: b = F("День экологических знаний."); break;
          case 17: b = F("Международный день кофе. Международный день цирка."); break;
          case 19: b = F("День велосипеда."); break;
          case 22: b = F("Международный день Матери-Земли."); break;
          case 26: b = F("Великий понедельник."); break;
          case 27: b = F("Великий вторник."); break;
          case 28: b = F("Великая среда. Всемирный день охраны труда. День химической безопасности."); break;
          case 29: b = F("Всемирный день желаний. Международный день танца. Чистый четверг."); break;
          case 30: b = F("Международный день джаза. Страстная пятница."); break;
          default: break;
        } break;


      case 5:
        switch (dd) {
          case 1: b = F("День международной солидарности трудящихся. День рождения почтовой марки. Страстная суббота (Великая суббота)."); break;
          case 2: b = F("Пасха Христова."); break;
          case 3: b = F("Всемирный день свободы печати. День рождения «спама». День Солнца."); break;
          case 4: b = F("День рождения складного зонтика."); break;
          case 5: b = F("День печати в Беларуси. Международный день акушерки. Международный день борьбы за права инвалидов."); break;
          case 7: b = F("День радио."); break;
          case 8: b = F("День рождения напитка «Кока-Кола». Международный день Красного Креста."); break;
          case 9: b = F("День Победы. Красная горка."); break;
          case 11: b = F("День глаженых шнурков. Радоница (Радуница)."); break;
          case 12: b = F("День экологического образования. Международный день медицинской сестры. День Государственного флага и герба."); break;
          case 13: b = F("Яков Теплый."); break;
          case 15: b = F("Международный день климата. Международный день отказника от военной службы по убеждениям совести. Международный день семей."); break;
          case 16: b = F("День биографов."); break;
          case 17: b = F("День пульмонолога. День рождения Интернета."); break;
          case 18: b = F("Международный день музеев."); break;
          case 19: b = F("День пионерии. День рождения кубика Рубика."); break;
          case 20: b = F("Всемирный день врача-травматолога. Всемирный день метрологии. День рождения джинсов."); break;
          case 21: b = F("День защиты от безработицы. Международный день Космоса."); break;
          case 22: b = F("День рождения тюбика для зубной пасты. Международный день биологического разнообразия."); break;
          case 23: b = F("Всемирный день черепахи."); break;
          case 24: b = F("День славянской письменности и культуры. Европейский день парков."); break;
          case 25: b = F("День филолога. Международный день пропавших детей."); break;
          case 27: b = F("День смелых решений. Международный день рассеянного склероза."); break;
          case 28: b = F("День брюнеток. День пограничника."); break;
          case 29: b = F("Международный день миротворцев ООН."); break;
          case 30: b = F("День химика. Международный день феминизма."); break;
          case 31: b = F("Всемирный день без табака. Всемирный день блондинок. День рождения велосипедного спорта."); break;
          default: break;
        } break;


      case 6:
        switch (dd) {
          case 1: b = F("Вознесение Господне. Всемирный день родителей. Международный день защиты детей."); break;
          case 2: b = F("День здорового питания и отказа от излишеств в еде. День спутникового мониторинга и навигации."); break;
          case 3: b = F("День рождения парашюта."); break;
          case 4: b = F("Международный день невинных детей – жертв агрессии."); break;
          case 5: b = F("Всемирный день охраны окружающей среды."); break;
          case 6: b = F("День рождения «Тетриса». День рождения электрического утюга. День русского языка."); break;
          case 8: b = F("Всемирный день океанов. День рождения пылесоса. Международный день домохозяйки и домохозяина."); break;
          case 9: b = F("Международный день аккредитации. Международный день друзей."); break;
          case 10: b = F("День рождения шариковой ручки."); break;
          case 12: b = F("Всемирный день борьбы с детским трудом. День рождения противогаза."); break;
          case 13: b = F("День рождения булавки. Международный день распространения информации об альбинизме."); break;
          case 14: b = F("Всемирный день донора крови. Международный день блогера."); break;
          case 15: b = F("Всемирный день ветра."); break;
          case 18: b = F("Всемирный день гармонии."); break;
          case 19: b = F("Троицкая суббота."); break;
          case 20: b = F("Троица. Всемирный день беженцев. День медицинского работника. День отца."); break;
          case 21: b = F("Всемирный день мотоциклиста. Духов день (День Святого Духа)."); break;
          case 22: b = F("День памяти и скорби (День начала ВОВ)."); break;
          case 23: b = F("День государственной службы. Международный Олимпийский день. Международный день балалайки."); break;
          case 25: b = F("День дружбы и единения славян. День моряка (мореплавателя)."); break;
          case 26: b = F("День рождения зубной щетки. Международный день борьбы против злоупотребления наркотиками и их незаконного оборота."); break;
          case 27: b = F("Всемирный день рыболовства. День рождения банкомата."); break;
          case 29: b = F("День учреждения Нобелевской Премии."); break;
          case 30: b = F("День экономиста."); break;
          default: break;
        } break;


      case 7:
        switch (dd) {
          case 2: b = F("День сюрпризов. Международный день спортивного журналиста."); break;
          case 6: b = F("Всемирный день поцелуя."); break;
          case 7: b = F("Иван Купала."); break;
          case 11: b = F("Всемирный день шоколада. День рыбака."); break;
          case 12: b = F("День фотографа."); break;
          case 14: b = F("День работников налоговых органов."); break;
          case 16: b = F("День рисования на асфальте."); break;
          case 17: b = F("День рождения кондиционера."); break;
          case 18: b = F("День металлурга."); break;
          case 20: b = F("Международный день шахмат."); break;
          case 24: b = F("День рождения растворимого кофе."); break;
          case 25: b = F("День работников торговли. День пожарной службы."); break;
          case 26: b = F("День загадывания загадок. День парашютиста."); break;
          case 28: b = F("День загадывания желаний."); break;
          case 30: b = F("Международный день дружбы."); break;
          default: break;
        } break;


      case 8:
        switch (dd) {
          case 1: b = F("День железнодорожника."); break;
          case 2: b = F("День Воздушно-десантных войск. Ильин день."); break;
          case 4: b = F("День рождения шампанского."); break;
          case 5: b = F("Международный день светофора."); break;
          case 6: b = F("День железнодорожных войск. Международный день «Врачи мира за мир»."); break;
          case 8: b = F("День строителя. Международный день альпинизма. Международный день офтальмологии."); break;
          case 9: b = F("День воздушных поцелуев."); break;
          case 13: b = F("Международный день левшей."); break;
          case 14: b = F("Медовый Спас."); break;
          case 15: b = F("День археолога."); break;
          case 19: b = F("Всемирный день гуманитарной помощи. Всемирный день фотографии. Яблочный Спас."); break;
          case 20: b = F("День спорта."); break;
          case 23: b = F("День работников государственной статистики."); break;
          case 29: b = F("День шахтера. Ореховый Спас."); break;
          case 31: b = F("День блога. День ветеринарного работника."); break;
          default: break;
        } break;


      case 9:
        switch (dd) {
          case 1: b = F("День знаний (Первый звонок)."); break;
          case 2: b = F("День окончания Второй мировой войны."); break;
          case 5: b = F("День работников нефтяной и газовой промышленности. Международный день благотворительности."); break;
          case 8: b = F("Международный день грамотности."); break;
          case 9: b = F("Всемирный день красоты."); break;
          case 11: b = F("Всемирный день оказания первой медицинской помощи."); break;
          case 12: b = F("День танкиста."); break;
          case 13: b = F("День программиста."); break;
          case 15: b = F("День рождения экологической организации «Гринпис»."); break;
          case 19: b = F("День рождения «Смайлика»."); break;
          case 20: b = F("День рекрутера."); break;
          case 21: b = F("Международный день мира."); break;
          case 22: b = F("Всемирный день без автомобиля."); break;
          case 23: b = F("День рождения поисковой системы Яндекс."); break;
          case 26: b = F("День машиностроителя. День рождения граммофона."); break;
          case 27: b = F("Воздвижение Креста Господня. Всемирный день туризма. День рождения поисковой системы Google."); break;
          case 29: b = F("Всемирный день сердца."); break;
          case 30: b = F("День Веры, Надежды и Любови. Международный день переводчика."); break;
          default: break;
        } break;


      case 10:
        switch (dd) {
          case 1: b = F("Всемирный день улыбки. Международный день музыки. Международный день пожилых людей."); break;
          case 2: b = F("День рождения электронной почты."); break;
          case 3: b = F("День учителя."); break;
          case 4: b = F("Всемирный день архитектуры. Всемирный день животных."); break;
          case 9: b = F("Всемирный день почты."); break;
          case 10: b = F("День рождения социальной сети «ВКонтакте»."); break;
          case 11: b = F("Международный день девочек."); break;
          case 13: b = F("День работников культуры."); break;
          case 14: b = F("День рождения Винни-Пуха. Покров Пресвятой Богородицы."); break;
          case 15: b = F("Всемирный день борьбы с раком молочной железы. День работников фармацевтической и микробиологической промышленности."); break;
          case 16: b = F("День Шефа (Босса)."); break;
          case 20: b = F("Всемирный день статистики. Международный день повара."); break;
          case 21: b = F("День лабиринта."); break;
          case 22: b = F("День рождения ксерокопии."); break;
          case 24: b = F("Международный день тещи."); break;
          case 25: b = F("День маркетолога. День мельников."); break;
          case 28: b = F("День бабушек и дедушек. Международный день анимации."); break;
          case 31: b = F("День автомобилиста. Хэллоуин."); break;
          default: break;
        } break;


      case 11:
        switch (dd) {
          case 1: b = F("Всемирный день вегана."); break;
          case 6: b = F("Всемирный день мужчин."); break;
          case 7: b = F("День Октябрьской Революции."); break;
          case 8: b = F("Международный день КВН."); break;
          case 11: b = F("День офтальмолога."); break;
          case 13: b = F("Всемирный день доброты."); break;
          case 14: b = F("Международный день логопеда. День кузнеца."); break;
          case 18: b = F("День рождения Микки Мауса."); break;
          case 19: b = F("Международный мужской день."); break;
          case 20: b = F("Всемирный день ребенка."); break;
          case 21: b = F("Всемирный день телевидения."); break;
          case 22: b = F("День сыновей."); break;
          case 24: b = F("День моржа."); break;
          case 26: b = F("Пилиповка."); break;
          case 28: b = F("День матери."); break;
          case 30: b = F("Всемирный день домашних животных. Международный день защиты информации."); break;
          default: break;
        } break;


      case 12:
        switch (dd) {
          case 1: b = F("Всемирный день борьбы со СПИДом. Международный день невролога."); break;
          case 3: b = F("Международный день инвалидов."); break;
          case 4: b = F("Введение во храм Пресвятой Богородицы."); break;
          case 5: b = F("День начала контрнаступления советских войск против немецко-фашистских войск в битве под Москвой в 1941 г. День Добровольца."); break;
          case 9: b = F("Международный день борьбы с коррупцией."); break;
          case 10: b = F("Всемирный день футбола. День Нобеля."); break;
          case 12: b = F("День Конституции РФ."); break;
          case 15: b = F("Международный день чая."); break;
          case 17: b = F("День Ракетных войск стратегического назначения."); break;
          case 18: b = F("Международный день мигрантов."); break;
          case 19: b = F("День рождения Кляксы! День святого Николая."); break;
          case 20: b = F("День работника органов безопасности (День ФСБ)."); break;
          case 22: b = F("День энергетика."); break;
          case 24: b = F("День взятия турецкой крепости Измаил русскими войсками под командованием А.В. Суворова в 1790 г."); break;
          case 25: b = F("Рождество Христово католическое."); break;
          case 26: b = F("День подарков."); break;
          case 27: b = F("День соблазнения."); break;
          case 30: b = F("День заворачивания подарков."); break;
          case 31: b = F("С НОВЫМ ГОДОМ !!!."); break;
          default: break;
        } break;
    }

    //Казахстан   	@khutr01
  } else if (region == 4) {
    switch (mm) {
      case 1:
        switch (dd) {
          case 1: b = F("Новый год!"); break;
          case 7: b = F("Рождество Христово."); break;
          case 10: b = F("День национальной гвардии."); break;
          case 14: b = F("Старый Новый год."); break;
          default: break;
        } break;


      case 2:
        switch (dd) {
          case 14: b = F("День Святого Валентина (День всех влюбленных)."); break;
          default: break;
        } break;


      case 3:
        switch (dd) {
          case 1: b = F("День благодарности."); break;
          case 8: b = F("Международный женский день."); break;
          case 16: b = F("День создания Республиканской гвардии."); break;
          case 21: b = F("Наурыз мейрамы!"); break;
          default: break;
        } break;


      case 4:
        switch (dd) {
          case 3: b = F("День геолога."); break;
          case 5: b = F("День миграционной полиции."); break;
          case 12: b = F("День космонавтики и День работников науки."); break;
          case 15: b = F("День влюбленных в Казахстане."); break;
          case 21: b = F("День Службы государственной охраны."); break;
          default: break;
        } break;


      case 5:
        switch (dd) {
          case 1: b = F("Праздник единства народа."); break;
          case 7: b = F("День защитника Отечества."); break;
          case 9: b = F("День Победы."); break;
          case 17: b = F("День работников связи и информатизации."); break;
          case 21: b = F("День работников культуры и искусства."); break;
          case 31: b = F("День памяти жертв политических репрессий и голода."); break;
          default: break;
        } break;


      case 6:
        switch (dd) {
          case 1: b = F("Международный день защиты детей."); break;
          case 4: b = F("День государственных символов."); break;
          case 5: b = F("День эколога."); break;
          case 6: b = F("День финансовой полиции."); break;
          case 23: b = F("День государственного служащего и День полиции."); break;
          case 28: b = F("День работников средств массовой информации."); break;
          default: break;
        } break;


      case 7:
        switch (dd) {
          case 2: b = F("День дипломатической службы."); break;
          case 6: b = F("День столицы."); break;
          case 13: b = F("День сотрудников органов национальной безопасности."); break;
          default: break;
        } break;


      case 8:
        switch (dd) {
          case 18: b = F("День пограничных войск."); break;
          case 30: b = F("День Конституции."); break;
          default: break;
        } break;


      case 9:
        switch (dd) {
          case 1: b = F("День знаний."); break;
          case 5: b = F("День языков."); break;
          case 8: b = F("Международный день солидарности журналистов."); break;
          case 28: b = F("День работников атомной отрасли."); break;
          case 30: b = F("День работников органов юстиции."); break;
          default: break;
        } break;


      case 10:
        switch (dd) {
          case 19: b = F("День спасателя."); break;
          default: break;
        } break;


      case 11:
        switch (dd) {
          case 8: b = F("День статистика."); break;
          case 15: b = F("День национальной валюты."); break;
          case 23: b = F("День дорожной полиции."); break;
          default: break;
        } break;


      case 12:
        switch (dd) {
          case 1: b = F("День Первого Президента."); break;
          case 6: b = F("День образования органов прокуратуры."); break;
          case 12: b = F("День образования таможенных органов."); break;
          case 16: b = F("День государственной независимости."); break;
          default: break;
        } break;
    }

    // Узбекистан     @Andros77
  } else if (region == 5) {
    switch (mm) {
      case 1: {
          switch (dd) {
            case 1: {
                b = F("C НОВЫМ ");
                b += gg;
                b += F(" ГОДОМ.");
              } break;
            case 8:  b = F("День работников органов прокуратуры."); break;
            case 14: b = F("День защитников Родины."); break;
            case 26: b = F("День работников органов таможенной службы."); break;
            default: break;
          }
        } break;


      case 2: {
          switch (dd) {
            case 9: b = F("День рождения Алишера Навои."); break;
            case 14: b = F("День рождения Бабура."); break;
            default: break;
          }
        } break;


      case 3: {
          switch (dd) {
            case 2: b = F("День вступления Республики Узбекистан в ООН."); break;
            case 4: b = F("День МЧС РУ."); break;
            case 8: b = F("Международный женский день."); break;
            case 21: b = F("Навруз!!!."); break;
            case 22: b = F("День рождения Мирзо Улугбека."); break;
            case 24: b = F("День Пограничника РУ."); break;
            default:  break;
          }
        } break;


      case 4: {
          switch (dd) {
            case 1: b = F("День смеха."); break;
            case 5: b = F("День Службы государственной безопасности РУ."); break;
            case 9: b = F("День рождения Амира Темура."); break;
            case 10: b = F("День рождения Абдуллы Кадыри."); break;
            case 12: b = F("День космонавтики."); break;
            default:  break;
          }
        } break;


      case 5: {
          switch (dd) {
            case 1: b = F("День фонтанов."); break;
            case 9: b = F("День памяти и почестей."); break;
            case 18: b = F("Международный день музеев."); break;
            case 31: b = F("Международный день борьбы с курением."); break;
            default:  break;
          }
        } break;


      case 6: {
          switch (dd) {
            case 1: b = F("Международный день защиты детей."); break;
            case 27: b = F("День печати и работников средств массовой информации."); break;
            case 30: b = F("День молодёжи Узбекистана."); break;
            default:  break;
          }
        } break;


      case 7: {
          switch (dd) {
            case 1: b = F("День введения национальной валюты  СУМ."); break;
            case 2: b = F("День принятия государственного герба РУ."); break;
            case 30: b = F("День дружбы народов."); break;
            default:  break;
          }
        } break;


      case 8: {
          switch (dd) {
            case 4: b = F("День образования Национальной Гвардии."); break;
            case 7: b = F("День работников железнодорожного транспорта."); break;
            case 17: b = F("День рождения Ташкента как столицы."); break;
            case 21: b = F("День Воздушного Флота РУ."); break;
            case 31: b = F("День памяти жертв репрессий в Узбекистане."); break;
            default: break;
          }
        } break;


      case 9: {
          switch (dd) {
            case 1: b = F("День Независимости Узбекистана."); break;
            case 6: b = F("День работников нефтяной и газовой промышленности."); break;
            case 20: b = F("День машиностроения."); break;
            case 27: b = F("Всемирный день туризма."); break;
            default: break;
          }
        } break;


      case 10: {
          switch (dd) {
            case 1: b = F("День учителя и наставника."); break;
            case 7: b = F("Международный день хлопка."); break;
            case 21: b = F("День узбекского языка."); break;
            case 25: b = F("День работников автомобильного транспорта."); break;
            default: break;
          }
        } break;


      case 11: {
          switch (dd) {
            case 6: b = F("День работника культуры в Узбекистане."); break;
            case 8: b = F("День медицинских работников."); break;
            case 11: b = F("День профсоюзов."); break;
            case 18: b = F("День принятия государственного флага Узбекистана."); break;
            case 19: b = F("День артиллерии Вооруженных Сил Узбекистана."); break;
            case 21: b = F("Всемирный день телевидения."); break;
            default: break;
          }
        } break;


      case 12: {
          switch (dd) {
            case 1: b = F("Всемирный день борьбы со СПИДом."); break;
            case 3: b = F("Международный день инвалидов."); break;
            case 8: b = F("День конституции Узбекистана."); break;
            case 10: b = F("День принятия государственного гимна Узбекистана."); break;
            case 11: b = F("День работников сельского хозяйства."); break;
            case 22: b = F("День работников энергетики."); break;
            case 31: {
                b = F("Последний день уходящего года. С НАСТУПАЮЩИМ ");
                b += gg + 1;
                b += F(" годом!");
                break;
              }
            default: break;
          }
        } break;
    }
  }

  if (razd && b != "") return ("  ***  " + b);
  return b;
}
